Public Attributes | List of all members
API_IFCPropertyBoundedValue Struct Reference
Element Manager API
IFC property with a lowerbound and an upperbound value. More...
#include <APIdefs_Properties.h>
 Public Attributes
API_IFCPropertyValue  | lowerBoundValue
Lowerbound value of the property.
API_IFCPropertyValue  | upperBoundValue
Upperbound value of the property.
Detailed Description
IFC property with a lowerbound and an upperbound value.
Remarks
This structure contains the lowerbound and upperbound values of an IfcPropertyBoundedValue. Both values shall have the same type.
Member Data Documentation
◆ lowerBoundValue
 API_IFCPropertyBoundedValue::lowerBoundValue
Lowerbound value of the property.
◆ upperBoundValue
 API_IFCPropertyBoundedValue::upperBoundValue
Upperbound value of the property.